# https://github.com/MarinaOkBerd/Python_Homework_3/blob/main/Task_20.py

print()
print('- - - - - - - - - - - - - - - - - - ')
print('--- Напишите программу, которая вычисляет стоимость введенного пользователем слова. ---')
print('--- Будем считать, что на вход подается только одно слово, ---')
print('--- которое содержит либо только английские, либо только русские буквы. ---')
print('- - - - - - - - - - - - - - - - - - ')
print()
# -I- -------------------------------------------------->->->

# -I- -------------------------------------------------<-<-<-
# -F- -------------------------------------------------->->->

# -F- -------------------------------------------------<-<-<-
# [ ] -------------------------------------------------->->->

list_letters = {1:"AEIOULNSTRАВЕИНОРСТ",
                2:"DGДКЛМПУ",
                3:"BCMPБГЁЬЯ",
                4:"FHVWYЙЫ",
                5:"KЖЗХЦЧ",
                8:"JXШЭЮ",
                10:"QZФЩЪ"}

word = input("Введите слово: ").upper()
summ = 0
for i in word:
    for k, v in list_letters.items():
        if i in v:
            summ += k
print(f"Стоимость слова: {summ}")

# [ ] -------------------------------------------------<-<-<-

print()
print('- - - - - - - - - - - - - - - - - - ')
