print()
print('- - - - - - - - - - - - - - - - - - ')
print('--- Заполните массив элементами арифметической прогрессии.  ---')
print('--- Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.  ---')
print('--- Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.  ---')
print('--- Каждое число вводится с новой строки.  ---')
print('- - - - - - - - - - - - - - - - - - ')
print()

# -F- ------------------------------------------------------
def sum(a, b):
    if b == 0:
        return a
    return sum(a+1, b-1)
# -F- ------------------------------------------------------

# a = int(input('Введите 1-е целое, неотрицательное число: '))
# b = int(input('Введите 2-е целое, неотрицательное число: '))
# print(f'Сумма чисел равна {sum(a, b)}')
# -F- ------------------------------------------------------
def ArithmeticProgressionFor1():
    for i in range(n):
        print(a1 + i * d)

def ArithmeticProgressionRec(a1, d, n):
    if n == 1:
        return [a1]
    else:
        progression = ArithmeticProgressionRec(a1, d, n-1)
        progression.append(a1 + (n-1)*d)
        return progression

# -F- ------------------------------------------------------
# [ ] -------------------------------------------------->->->

a1 = int(input('Введите 1-й элемент: '))
d = int(input('Введите шаг (разность между элементами массива: '))
n = int(input('Введите количество элементов массива: '))


print()
ArithmeticProgressionFor1()
print()
progression = ArithmeticProgressionRec(a1, d, n)
print(progression)

# [ ] -------------------------------------------------<-<-<-
print()
print('- - - - - - - - - - - - - - - - - - ')
