print()
print('- - - - - - - - - - - - - - - - - - ')
print('--- Определить индексы элементов массива (списка), ---')
print('--- значения которых принадлежат заданному диапазону  ---')
print('--- (т.е. не меньше заданного минимума и не больше заданного максимума).  ---')
print('- - - - - - - - - - - - - - - - - - ')
print()

# -F- ------------------------------------------------------

# -F- ------------------------------------------------------

# [ ] -------------------------------------------------->->->

list_1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min = int(input('Введите минимальное число: '))
max = int(input('Введите максимальное число: '))
# min, max = 6, 10

# [ ] --1.----------------------------------------------------
indexes = []
for i in range(len(list_1)):
    if min <= list_1[i] <= max:
        indexes.append(i)
print(indexes)

# [ ] --2.----------------------------------------------------
list_rez = []
for i in range(len(list_1)):
    if list_1[i] >= min and list_1[i] <= max:
        list_rez.append(i)
print(list_rez)

# [ ] --3.----------------------------------------------------
for i in range(len(list_1)):
    if min <= list_1[i] <= max:
        print(i, end=' ')
print()

# [ ] -------------------------------------------------<-<-<-
print()
print('- - - - - - - - - - - - - - - - - - ')

