print()
print('- - - - - - - - - - - - - - - - - - ')
print('--- Напишите программу для нахождения максимального числа ягод, ---')
print('--- которое может собрать за один заход собирающий модуль,  ---')
print('--- находясь перед некоторым кустом заданной во входном файле грядки. ---')
print('- - - - - - - - - - - - - - - - - - ')
print()
# [ ] -------------------------------------------------->->->

n=int(input('Количество кустов: '))
arr=list()
for i in range(n):
    x=int(input(f'Количество ягод на {i+1} кусте: '))
    arr.append(x)

arr_count=list()
for i in range(len(arr) -1):
    arr_count.append(arr[i-1]+arr[i]+arr[i+1])
arr_count.append(arr[-2]+arr[-1]+arr[0])
print(max(arr_count))
# [ ] -------------------------------------------------<-<-<-
print()
print('- - - - - - - - - - - - - - - - - - ')
