print()
print('- - - - - - - - - - - - - - - - - - ')
print('--- Задайте список из нескольких чисел.  ---')
print('--- Напишите программу, которая найдёт сумму элементов списка, ---')
print('--- стоящих на нечётной позиции. ---')
print('- - - - - - - - - - - - - - - - - - ')
print()

lst = [2, 3, 4, 5, 6]


print()
