print()
print('- - - - - - - - - - - - - - - - - - ')
print('--- Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. ---')
print('--- Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. ---')
print('--- В последующих строках записаны N целых чисел Ai. ---')
print('--- Последняя строка содержит число X. ---')
print('- - - - - - - - - - - - - - - - - - ')
print()
# -I- -------------------------------------------------->->->
import random
# -I- -------------------------------------------------<-<-<-
# -F- -------------------------------------------------->->->
def RandomNumbers():
    min, max = 0, 10
    for i in range(N):
        number = random.randint(min, max)
        A.append(number)

def SearchCount():
    count = 0
    for i in A:
        if i == X:
            count += 1
    print()
    print(f'Число {X} в массиве \'А\' встречается {count} раз.')
# -F- -------------------------------------------------<-<-<-
# [ ] -------------------------------------------------->->->
N = int(input('Введите количество элементов массива: '))
A = []
RandomNumbers()
print(f'Массив \'A\' = {A}')
X = int(input('Какое число ищем?: '))
SearchCount()
# [ ] -------------------------------------------------<-<-<-

print()
print('- - - - - - - - - - - - - - - - - - ')
