print()
print('- - - - - - - - - - - - - - - - - - ')
print('--- Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. ---')
print('--- Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. ---')
print('--- В последующих строках записаны N целых чисел Ai. ---')
print('--- Последняя строка содержит число X. ---')
print('- - - - - - - - - - - - - - - - - - ')
print()
# -I- -------------------------------------------------->->->
import random
# -I- -------------------------------------------------<-<-<-
# -F- -------------------------------------------------->->->
def RandomNumbers():
    min, max = 0, 99
    for i in range(N):
        number = random.randint(min, max)
        Ai.append(number)

def SearchDifference():
    ResFin = abs(X - Ai[0])
    index = 0
    for i in range(1, N):
        Res = abs(X - Ai[i])
        if Res < ResFin:
            ResFin = Res
            index = i
    # print(ResFin)

    print()
    print(f'Число {Ai[index]} в позиции Аi[{index}], ближайшее к числу {X}.')
    print(f'Разница равна {ResFin}.')
# -F- -------------------------------------------------<-<-<-
# [ ] -------------------------------------------------->->->
N = int(input('Введите количество элементов массива: '))
Ai = []
RandomNumbers()
print(f'Массив \'Ai\' = {Ai}')
X = int(input('Введите число: '))
SearchDifference()
# [ ] -------------------------------------------------<-<-<-

print()
print('- - - - - - - - - - - - - - - - - - ')
